Workspace/run/steadyState-01/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-0.5 -0.5 -0.23) //0
    ( 0.5 -0.5 -0.23) //1
    ( 0.5  0.5 -0.23) //2
    (-0.5  0.5 -0.23) //3

    (-0.5 -0.5  0.27) //4
    ( 0.5 -0.5  0.27) //5
    ( 0.5  0.5  0.27) //6
    (-0.5  0.5  0.27) //7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (14 14 7) simpleGrading (1 1 1)
);

edges
(
);

boundary
(

    walls
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (2 3 7 6)
            (0 3 7 4)
            (1 2 6 5)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (4 5 6 7)

        );
    }
    outlet
    {
        type patch;
        faces
        (
            (0 1 2 3)
        );
    }
);

// ************************************************************************* //
